{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 2], "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "normal", "scale": 1.0}}, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "dtype": "float32", "units": 2, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 2], "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "normal", "scale": 1.0}}, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "dtype": "float32", "units": 1, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}}], "keras_version": "2.0.4"}